In [1]:
import numpy as np
import pandas as pd

In [2]:
dv19=pd.read_csv("C:/Users/lenovo/OneDrive/Desktop/Telangana Project/domestic visitors/domestic_visitors_2019.csv")
dv16=pd.read_csv("C:/Users/lenovo/OneDrive/Desktop/Telangana Project/domestic visitors/domestic_visitors_2016.csv")
dv17=pd.read_csv("C:/Users/lenovo/OneDrive/Desktop/Telangana Project/domestic visitors/domestic_visitors_2017.csv")
dv18=pd.read_csv("C:/Users/lenovo/OneDrive/Desktop/Telangana Project/domestic visitors/domestic_visitors_2018.csv")

In [3]:
dv19.shape

(396, 5)

In [4]:
dv=pd.concat([dv16,dv17,dv18,dv19])

In [5]:
dv.shape

(1512, 5)

In [6]:
fv16=pd.read_csv("C:/Users/lenovo/OneDrive/Desktop/Telangana Project/foreign visitors/foreign_visitors_2016.csv")
fv17=pd.read_csv("C:/Users/lenovo/OneDrive/Desktop/Telangana Project/foreign visitors/foreign_visitors_2017.csv")
fv18=pd.read_csv("C:/Users/lenovo/OneDrive/Desktop/Telangana Project/foreign visitors/foreign_visitors_2018.csv")
fv19=pd.read_csv("C:/Users/lenovo/OneDrive/Desktop/Telangana Project/foreign visitors/foreign_visitors_2019.csv")

In [7]:
fv=pd.concat([fv16,fv17,fv18,fv19])

In [8]:
fv.head(5)

   district        date     month  year visitors
0  Adilabad  01-01-2016   January  2016        2
1  Adilabad  01-02-2016  February  2016        0
2  Adilabad  01-03-2016     March  2016        2
3  Adilabad  01-04-2016     April  2016        0
4  Adilabad  01-05-2016       May  2016        0

In [9]:
dv.head(5)

   district        date     month  year visitors
0  Adilabad  01-01-2016   January  2016   792136
1  Adilabad  01-02-2016  February  2016   937820
2  Adilabad  01-03-2016     March  2016   582946
3  Adilabad  01-04-2016     April  2016   341948
4  Adilabad  01-05-2016       May  2016   252887

In [9]:
fv.isnull().sum()

district    0
date        0
month       0
year        0
visitors    0
dtype: int64

In [10]:
dv.isnull().sum()

district     0
date         0
month        0
year         0
visitors    30
dtype: int64

In [11]:
fv.duplicated().sum()

0

In [12]:
dv.duplicated().sum()

0

In [13]:
dv[dv['visitors']==' ']

                  district        date      month  year visitors
12   Bhadradri Kothagudem   01-01-2016    January  2016
13   Bhadradri Kothagudem   01-02-2016   February  2016
14   Bhadradri Kothagudem   01-03-2016      March  2016
15   Bhadradri Kothagudem   01-04-2016      April  2016
16   Bhadradri Kothagudem   01-05-2016        May  2016
..                     ...         ...        ...   ...      ...
343              Vikarabad  01-08-2019     August  2019
344              Vikarabad  01-09-2019  September  2019
345              Vikarabad  01-10-2019    October  2019
346              Vikarabad  01-11-2019   November  2019
347              Vikarabad  01-12-2019   December  2019

[315 rows x 5 columns]

In [14]:
dv.isnull().sum()

district     0
date         0
month        0
year         0
visitors    30
dtype: int64

In [15]:
dv.fillna(0,inplace=True)

In [16]:
dv.isnull().sum()

district    0
date        0
month       0
year        0
visitors    0
dtype: int64

In [17]:
dv[dv['visitors']==' ']

                  district        date      month  year visitors
12   Bhadradri Kothagudem   01-01-2016    January  2016
13   Bhadradri Kothagudem   01-02-2016   February  2016
14   Bhadradri Kothagudem   01-03-2016      March  2016
15   Bhadradri Kothagudem   01-04-2016      April  2016
16   Bhadradri Kothagudem   01-05-2016        May  2016
..                     ...         ...        ...   ...      ...
343              Vikarabad  01-08-2019     August  2019
344              Vikarabad  01-09-2019  September  2019
345              Vikarabad  01-10-2019    October  2019
346              Vikarabad  01-11-2019   November  2019
347              Vikarabad  01-12-2019   December  2019

[315 rows x 5 columns]

In [18]:
dv.replace(' ',0,inplace=True)

In [19]:
fv[fv['visitors']==' ']

                  district        date      month  year visitors
12   Bhadradri Kothagudem   01-01-2016    January  2016
13   Bhadradri Kothagudem   01-02-2016   February  2016
14   Bhadradri Kothagudem   01-03-2016      March  2016
15   Bhadradri Kothagudem   01-04-2016      April  2016
16   Bhadradri Kothagudem   01-05-2016        May  2016
..                     ...         ...        ...   ...      ...
343              Vikarabad  01-08-2019     August  2019
344              Vikarabad  01-09-2019  September  2019
345              Vikarabad  01-10-2019    October  2019
346              Vikarabad  01-11-2019   November  2019
347              Vikarabad  01-12-2019   December  2019

[320 rows x 5 columns]

In [20]:
fv.replace(' ',0,inplace=True)

In [51]:
fv.to_csv('foreign_visitors')
dv.to_csv('domestic_visitors')